Revit 2026 API

# SchemaCommon Class

---

A static class that provides access to the property names that appear in all the visual Asset types.

SystemObject Autodesk.Revit.DB.VisualSchemaCommon

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SchemaCommon
```
```vb
Public NotInheritable Class SchemaCommon
```
```cpp
public ref class SchemaCommon abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SchemaCommon = class end
```

The SchemaCommon type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BaseSchema | The property labeled "BaseSchema" common to all visual Asset types. |
|  | Category | The property labeled "Category" common to all visual Asset types. |
|  | Description | The property labeled "Description" common to all visual Asset types. |
|  | Hidden | The property labeled "Hidden" common to all visual Asset types. |
|  | Keyword | The property labeled "Keyword" common to all visual Asset types. |
|  | Thumbnail | The property labeled "Thumbnail" common to all visual Asset types. |
|  | UIName | The property labeled "UIName" common to all visual Asset types. |
|  | VersionGUID | The property labeled "VersionGUID" common to all visual Asset types. |

#### Reference

Autodesk.Revit.DB.Visual Namespace